{
    "name": "Gnome",
    "description": "Gnomes are magical folk created by gods of invention, illusions, and life underground. The earliest gnomes were seldom seen by other folk due to the gnomes' secretive nature and their propensity for living in forests and burrows.",
    "source": "PHB",
    "source_page": 0,
    "creature_type": "Humanoid",
    "age": {
        "lifespan": "425 years"
    },
    "size": {
        "category": "Small",
        "description": "about 3-4 feet tall"
    },
    "speed": {
        "walk": 30
    },
    "traits": [
        {
            "name": "Darkvision",
            "description": "You have Darkvision with a range of 60 feet.",
            "range": 60
        },
        {
            "name": "Gnomish Cunning",
            "description": "You have Advantage on Intelligence, Wisdom, and Charisma saving throws.",
            "grants": {
                "saving_throw_advantages": ["Intelligence", "Wisdom", "Charisma"]
            }
        },
        {
            "name": "Gnomish Lineage",
            "description": "You are part of a lineage that grants you supernatural abilities. Choose one of the following options; whichever one you choose, Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage):",
            "choice_required": true,
            "spellcasting_ability_choice": ["intelligence", "wisdom", "charisma"],
            "options": [
                {
                    "name": "Forest Gnome",
                    "description": "You know the Minor Illusion cantrip. You also always have the Speak with Animals spell prepared. You can cast it without a spell slot a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest. You can also use any spell slots you have to cast the spell.",
                    "grants": {
                        "cantrips": ["minor_illusion"],
                        "spells": ["speak_with_animals"],
                        "spell_uses": "proficiency_bonus_per_long_rest"
                    }
                },
                {
                    "name": "Rock Gnome",
                    "description": "You know the Mending and Prestidigitation cantrips. In addition, you can spend 10 minutes casting Prestidigitation to create a Tiny clockwork device (AC 5, 1 HP), such as a toy, fire starter, or music box. When you create the device, you determine its function by choosing one effect from Prestidigitation; the device produces that effect whenever you or another creature takes a Bonus Action to activate it with a touch. If the chosen effect has options within it, you choose one of those options for the device when you create it. For example, if you choose the spell's ignite-extinguish effect, you determine whether the device ignites or extinguishes fire; the device doesn't do both. You can have three such devices in existence at a time, and each falls apart 8 hours after its creation or when you dismantle it with a touch as a Utilize action.",
                    "grants": {
                        "cantrips": ["mending", "prestidigitation"],
                        "clockwork_devices": {
                            "max_devices": 3,
                            "duration": "8 hours",
                            "creation_time": "10 minutes",
                            "activation": "bonus_action"
                        }
                    }
                }
            ]
        }
    ],
    "version": "5.5E"
} 