{
    "name": "ROGUE",
    "description": "A rogue character class with unique abilities and features.",
    "hit_dice": "1d8",
    "starting_class_benefits": {
        "description": "Benefits gained when ROGUE is your first class",
        "primary_ability": [
            "dexterity"
        ],
        "standard_array_recommendations": [
            {
                "name": "Standard",
                "description": "Classic skill monkey and sneak attacker",
                "array": {
                    "strength": 8,
                    "dexterity": 15,
                    "constitution": 13,
                    "intelligence": 14,
                    "wisdom": 12,
                    "charisma": 10
                }
            },
            {
                "name": "Face Rogue",
                "description": "For swashbuckler or party face style rogue",
                "array": {
                    "strength": 8,
                    "dexterity": 15,
                    "constitution": 13,
                    "intelligence": 10,
                    "wisdom": 12,
                    "charisma": 14
                }
            }
        ],
        "saving_throw_proficiencies": [
            "dexterity",
            "intelligence"
        ],
        "armor_proficiencies": [
            "light armor"
        ],
        "weapon_proficiencies": [
            "simple weapons",
            "martial weapons that have the finesse property"
        ],
        "tool_proficiencies": [
            "Thieves’ Tools"
        ],
        "skill_proficiencies": {
            "choose": 4,
            "from": [
                ": Acrobatics",
                "Athletics",
                "Deception",
                "Insight",
                "Intimidation",
                "Investigation",
                "Perception",
                "Persuasion",
                "Sleight of Hand",
                "Stealth"
            ]
        },
        "equipment_grants": {
            "choice": {
                "description": "Choose one of the following equipment packages",
                "options": [
                    {
                        "name": "Equipment Package",
                        "description": "Standard rogue equipment and gold",
                        "fixed": [
                            {
                                "item": "Arrows",
                                "quantity": 20,
                                "description": "Arrows"
                            },
                            {
                                "item": "Burglar’s Pack",
                                "quantity": 1,
                                "description": "Burglar’s Pack"
                            },
                            {
                                "item": "Dagger",
                                "quantity": 2,
                                "description": "Dagger"
                            },
                            {
                                "item": "Leather Armor",
                                "quantity": 1,
                                "description": "Leather Armor"
                            },
                            {
                                "item": "Quiver",
                                "quantity": 1,
                                "description": "Quiver"
                            },
                            {
                                "item": "Shortbow",
                                "quantity": 1,
                                "description": "Shortbow"
                            },
                            {
                                "item": "Shortsword",
                                "quantity": 1,
                                "description": "Shortsword"
                            },
                            {
                                "item": "Thieves’ Tools",
                                "quantity": 1,
                                "description": "Thieves’ Tools"
                            }
                        ],
                        "currency": {
                            "gold": 8
                        }
                    },
                    {
                        "name": "Gold Only",
                        "description": "Choose gold instead of equipment",
                        "currency": {
                            "gold": 24
                        }
                    }
                ]
            }
        }
    },
    "multiclass_benefits": {
        "description": "Benefits gained when multiclassing into ROGUE",
        "prerequisites": {
            "minimum_ability_scores": {
                "dexterity": 13
            }
        },
        "weapon_proficiencies": [
            "simple weapons"
        ],
        "armor_proficiencies": [
            "light armor"
        ]
    },
    "features": {},
    "subclasses": {
        "ARCANE TRICKSTER": {
            "name": "ARCANE TRICKSTER",
            "description": "Some Rogues enhance their fine-honed skills of stealth and agility with Arcane spells, learning magical tricks to aid them in their trade. Some Arcane Tricksters use their talents as pickpockets and burglars, while others are pranksters, mischief-makers, or adventurers. 3RD LEVEL: SPELLCASTING You have learned to cast spells. See the Player’s Handbook for the rules on spellcasting. The information below details how you use those rules as an Arcane Trickster. Cantrips. You know three cantrips: Mage Hand and two other cantrips of your choice from the Wizard spell list. Whenever you gain a Rogue level, you can replace one of your cantrips, except Mage Hand, with another Wizard cantrip of your choice. When you reach Rogue level 10, you learn another Wizard cantrip of your choice. Spell Slots. ...",
            "features": {
                "3": [
                    {
                        "name": "SPELLCASTING",
                        "description": "You have learned to cast spells. See the Player’s Handbook for the rules on spellcasting. The information below details how you use those rules as an Arcane Trickster. Cantrips. You know three cantrips: Mage Hand and two other cantrips of your choice from the Wizard spell list. Whenever you gain a Rogue level, you can replace one of your cantrips, except Mage Hand, with another Wizard cantrip of your choice. When you reach Rogue level 10, you learn another Wizard cantrip of your choice. Spell Slots. The Arcane Trickster Spellcasting table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a Long Rest. Prepared Spells of Level 1+. You prepare a list of spells of level 1+ that are available for you to cast with this feature. To start, choose three level 1 Wizard spells. The number of spells on your list increases as you gain Rogue levels, as shown in the Prepared Spells column of the Arcane Trickster Spellcasting table. Whenever that number increases, choose additional Wizard spells until the number of spells on your list matches the number in the Arcane Trickster Spellcasting table. The chosen spells must be of a level for which you have spell slots. Changing Your Prepared Spells. Whenever you gain a Rogue level, you can replace one spell on your list with another Wizard spell for which you have spell slots. Spellcasting Ability. Intelligence is your spellcasting ability for your Arcane Trickster spells. Spellcasting Focus. You can use an Arcane Focus as a Spellcasting Focus for your Wizard spells. the arcane trickster spell table",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "MAGE HAND LEGERDEMAIN",
                        "description": "When you cast Mage Hand, you can cast it as a Bonus Action, and you can make the spectral hand Invisible. You can control the hand as a Bonus Action, and through it, you can make Dexterity (Sleight of Hand) checks.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "MAGICAL AMBUSH",
                        "description": "If you have the Invisible condition when you cast a spell on a creature, it has Disadvantage on any saving throw it makes against the spell on the same turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "VERSATILE TRICKSTER",
                        "description": "You gain the ability to distract targets with your Mage Hand. When you use the Trip options of your Cunning Strike on a creature, you can also use that option on another creature within 5 feet of the spectral hand.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "SPELL THIEF",
                        "description": "You gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster. Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your Reaction to force the creature to make an Intelligence saving throw. The DC equals your Spell Save DC. On a failed save, you negate the spell’s effect against you, and you steal the knowledge of the spell if it is at least level 1 and of a level you can cast (it doesn’t need to be a Wizard spell). For the next 8 hours, you have the spell prepared. The creature can’t cast it until the 8 hours have passed. Once you steal a spell with this feature, you can’t use this feature again until you finish a Long Rest.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "ASSASSIN": {
            "name": "ASSASSIN",
            "description": "An Assassin’s training focuses on the grim art of death, using stealth, poison, and disguise to eliminate foes with deadly efficiency. While some Rogues who follow this path are hired killers, spies, or bounty hunters, the capabilities of this subclass are equally useful for adventurers facing a variety of monstrous enemies. 3RD LEVEL: BONUS PROFICIENCIES You gain a Disguise Kit and a Poisoner’s Kit and you have proficiency with them. 3RD LEVEL: ASSASSINATE You are adept at ambushing a target, granting you the following benefits: Initiative. You have Advantage on Initiative rolls. Surprising Strikes. During the first round of each combat, you have Advantage on attack rolls against any creature that hasn’t taken a turn. If your Sneak Attack hits any target during that round, the target take...",
            "features": {
                "3": [
                    {
                        "name": "BONUS PROFICIENCIES",
                        "description": "You gain a Disguise Kit and a Poisoner’s Kit and you have proficiency with them.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "ASSASSINATE",
                        "description": "You are adept at ambushing a target, granting you the following benefits: Initiative. You have Advantage on Initiative rolls. Surprising Strikes. During the first round of each combat, you have Advantage on attack rolls against any creature that hasn’t taken a turn. If your Sneak Attack hits any target during that round, the target takes extra damage of the weapon’s type equal to your Rogue level.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "INFILTRATION EXPERTISE",
                        "description": "You are expert at following techniques that aid your infiltrations: Masterful Mimicry. You can also unerringly mimic another person’s speech, handwriting or both if you have spent at least one hour studying them. Roving Aim. Your Speed isn't reduced to 0 by using Steady Aim.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "ENVENOM WEAPONS",
                        "description": "When you use the Poison option of your Cunning Strike, the target also takes 2d6 Poison damage whenever it fails the saving throw. This damage ignores Resistance to Poison damage.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "DEATH STRIKE",
                        "description": "When you hit with your Sneak Attack on the first round of a combat, the target must succeed on a Constitution saving throw (DC 8 + your Dexterity modifier + your Proficiency Bonus), or the attack’s damage is doubled against the target.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "SOULKNIFE": {
            "name": "SOULKNIFE",
            "description": "Most assassins strike with physical weapons, and many burglars and spies use thieves' tools to infiltrate secure locations. In contrast, a Soulknife strikes and infiltrates with the mind, cutting through barriers both physical and psychic. These rogues discover psionic power within themselves and channel it to do their roguish work. They find easy employment as members of thieves' guilds, though they are often mistrusted by rogues who are leery of anyone using strange mind powers to conduct their business. Most governments would also be happy to employ a Soulknife as a spy. Amid the trees of ancient forests on the Material Plane and in the Feywild, some wood elves walk the path of the Soulknife, serving as silent, lethal guardians of their woods. In the endless war among the gith, a githze...",
            "features": {
                "3": [
                    {
                        "name": "Psionic Power",
                        "description": "You harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel certain psionic powers you have from this subclass. The Soulknife Energy Dice table shows the number of these dice you gave when you reach certain Rogue levels and the table shows the die size. Soulknife Energy Dice table Level\tNumber of Dice\tDie Size 3\t4\tD6 5\t6\tD8 9\t8\tD8 13\t10\tD10 17\t12\tD12 Any features in this subclass that use a Psionic Energy Die use only dice from this subclass. Some of your powers expend the Psionic Energy Die, as specified in a power's description, and you can't use a power if it requires you to use a die when your Psionic Energy Dice are all expended. You regain one of your expended Psionic Energy Dice when you finish a Short Rest, and you regain all of them when you finish a Long Rest. The powers below use your Psionic Energy dice: Psi-Bolstered Knack. If you fail an ability check using a skill or tool with which you have Proficiency, you can roll one Psionic Energy Die and add the number rolled to the check, potentially turning failure into success. The die is expend only if the roll succeeds. Psychic Whispers. You can establish telepathic communication between yourself and others. As a Magic Action, choose one or more creatures you can see, up to a number of creatures equal to your Proficiency Bonus, and then roll one Psionic Energy Die. For a number of hours equal to the number rolled, the chosen creatures can speak telepathically with you, and you can speak telepathically with them. To send or receive a message (no action required), you and the other creature must be within 1 mile of each other. A creature can end the telepathic connection at any time (no action required). The first time you use this power after each Long Rest, you don't expend the Psionic Energy Die. All other times you use the power, you expend the die.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "Psychic Blades",
                        "description": "You can manifest shimmering blades of psychic energy. Whenever you take the Attack action or make an Opportunity Attack, you can manifest a psychic blade in your free hand and make the attack with that blade. This magic blade has the following traits: Weapon Category: Simple Melee Damage on Hit: 1d6 Psychic + the ability modifier used for the attack roll Properties: Finesse, Thrown (range 60/120 feet) Mastery: Vex (you can use this property and it doesn't count against the number of properties you can use with Weapon Mastery) The blade vanishes immediately after it hits or misses its target, and it leaves no mark on its target if it deals damage. After you attack with the blade on your turn, you can make a melee or ranged weapon attack with a second psychic blade as a Bonus Action on the same turn if your other hand is free to create it. The damage die of this bonus attack is 1d4, instead of 1d6.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "Soul Blades",
                        "description": "You can now use the following powers with your Psychic Blades: Homing Strikes. If you make an attack roll with your Psychic Blades and miss the target, you can roll one Psionic Energy Die and add the number rolled to the attack roll. If this causes the attack to hit, the die is expended. Psychic Teleportation. As a Bonus Action, you manifest a Psychic Blade, expend one Psionic Energy Die and roll it, and throw the blade at an unoccupied space you can see, up to a number of feet away equal to 10 times the number rolled. You then teleport to that space, and the blade vanishes.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "Psychic Veil",
                        "description": "You can weave a veil of psychic static to mask yourself. As a Magic Action, you gain the Invisible condition for 1 hour or until you dismiss this effect (no action required). This invisibility ends early immediately after you deal damage to a creature or you force a creature to make a saving throw. Once you use this feature, you can't do so again until you finish a Long Rest, unless you expend a Psionic Energy Die (no action required) to restore your use of it.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "Rend Mind",
                        "description": "You can sweep your Psychic Blade directly through a creature's mind. When you use your Psychic Blades to deal Sneak Attack damage to a creature, you can force that target to make a Wisdom saving throw (DC equal to 8 + your Proficiency Bonus + your Dexterity modifier). If the save fails, the target has the Stunned condition for 1 minute. The Stunned target repeats the save at the end of each of its turns, ending the effect on itself on a success. Once you use this feature, you can't do so again until you finish a long rest, unless you expend three Psionic Energy Dice (no action required) to use it again.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "THIEF": {
            "name": "THIEF",
            "description": "A mix of burglar, treasure hunter, and explorer, you are the consummate adventurer. In addition to improving your agility and stealthiness, you gain abilities useful for delving into ruins and getting maximum benefit from the magic items you find there. 3RD LEVEL: FAST HANDS As a Bonus Action, you can do one of the following: Sleight of Hand. Make a Dexterity (Sleight of Hand) check to pick a lock or disarm a trap with Thieves’ Tools or to pick a pocket. Use an Object. Take the Utilize action, or take the Magic Action to use a magic item that requires that action. 3RD LEVEL: SECOND-STORY WORK You have trained to get into especially hard-to-reach places, granting you these benefits: Climber. You gain a Climb Speed equal to your Speed. Jumper. You can determine your jump distance using your ...",
            "features": {
                "3": [
                    {
                        "name": "FAST HANDS",
                        "description": "As a Bonus Action, you can do one of the following: Sleight of Hand. Make a Dexterity (Sleight of Hand) check to pick a lock or disarm a trap with Thieves’ Tools or to pick a pocket. Use an Object. Take the Utilize action, or take the Magic Action to use a magic item that requires that action.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "SECOND-STORY WORK",
                        "description": "You have trained to get into especially hard-to-reach places, granting you these benefits: Climber. You gain a Climb Speed equal to your Speed. Jumper. You can determine your jump distance using your Dexterity rather than your Strength.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "SUPREME SNEAK",
                        "description": "You gain the following Cunning Strike option: Stealth Attack (Cost: 1d6). If you have the Hide action’s Invisible condition, this attack doesn’t end that condition on you if you end the turn behind Three-Quarters Cover or Total Cover.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "USE MAGIC DEVICE",
                        "description": "You've learned how to maximize use of magic items, granting you the following benefits: Attunement. You can attune to up to four magic items at once. Charges. Whenever you use a magic item property that expends charges, roll a d6. On a roll of 6, you use the property without expending the charges. Scrolls. You can use any Spell Scroll, using Intelligence as your Spellcasting Ability for the spell. If the spell is a cantrip or a 1st-level spell, you can cast it reliably. If the scroll contains a higher-level spell, you must first succeed on an Intelligence (Arcana) check with a DC equal to 10 plus the spell’s level. On a successful check, you cast the spell from the scroll. On a failed check, the scroll disintegrates.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "THIEF’S REFLEXES",
                        "description": "You are adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal Initiative and your second turn at your Initiative minus 10.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "Inquisitor": {
            "name": "Inquisitor",
            "description": "As an archetypal Inquisitive, you excel at rooting out secrets and unraveling mysteries. You rely on your sharp eye for detail, but also on your finely honed ability to read the words and deeds of other creatures to determine their true intent. You excel at defeating creatures that hide among and prey upon ordinary folk, and your mastery of lore and your sharp eye make you well equipped to expose and end hidden evils.",
            "features": {
                "3": [
                    {
                        "name": "EAR FOR DECEIT",
                        "description": "You develop a keen ear for picking out lies. Whenever you make a Wisdom (Insight) check to determine whether a creature is lying, treat a roll of 7 or lower on the d20 as an 8.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "EYE FOR DETAIL",
                        "description": "You can use a bonus action to make a Wisdom (Perception) check to spot a hidden creature or object or to make an Intelligence (Investigation) check to uncover or decipher clues.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "INSIGHTFUL FIGHTING",
                        "description": "You gain the ability to decipher an opponent’s tactics and develop a counter to them. As a bonus action, you make a Wisdom (Insight) check against a creature you can see that isn’t incapacitated, contested by the target’s Charisma (Deception) check. If you succeed, you can use your Sneak Attack against that target even if you don't have advantage on the attack roll, but not if you have disadvantage on it. This benefit lasts for 1 minute or until you successfully use this feature against a different target.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "STEADY EYE",
                        "description": "You gain advantage on any Wisdom (Perception) or Intelligence (Investigation) check if you move no more than half your speed on the same turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "UNERRING EYE",
                        "description": "Your senses are almost impossible to foil. As an action, you sense the presence of illusions, shapechangers not in their original form, and other magic designed to deceive the senses within 30 feet of you, provided you aren't blinded or deafened. You sense that an effect is attempting to trick you, but you gain no insight into what is hidden or into its true nature. You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "EYE FOR WEAKNESS",
                        "description": "You learn to exploit a creature’s weaknesses by carefully studying its tactics and movement. While your Insightful Fighting feature applies to a creature, your Sneak Attack damage against that creature increases by 3d6.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "Mastermind": {
            "name": "Mastermind",
            "description": "Your focus is on people and on the influence and secrets they have. Many spies, courtiers, and schemers follow this archetype, leading lives of intrigue. Words are your weapons as often as knives or poison, and secrets and favors are some of your favorite treasures.",
            "features": {
                "3": [
                    {
                        "name": "MASTER OF INTRIGUE",
                        "description": "You gain proficiency with the disguise kit, the forgery kit, and one gaming set of your choice. You also learn two languages of your choice. Additionally, you can unerringly mimic the speech patterns and accent of a creature that you hear speak for at least 1 minute, enabling you to pass yourself off as a native speaker of a particular land, provided that you know the language.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "MASTER OF TACTICS",
                        "description": "You can use the Help action as a bonus action. Additionally, when you use the Help action to aid an ally in attacking a creature, the target of that attack can be within 30 feet of you, rather than 5 feet of you, if the target can see or hear you.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "INSIGHTFUL MANIPULATOR",
                        "description": "If you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own. The DM tells you if the creature is your equal, superior, or inferior in regard to two of the following characteristics of your choice:",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "MISDIRECTION",
                        "description": "You can sometimes cause another creature to suffer an attack meant for you. When you are targeted by an attack while a creature within 5 feet of you is granting you cover against that attack, you can use your reaction to have the attack target that creature instead of you.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "SOUL OF DECEIT",
                        "description": "Your thoughts can't be read by telepathy or other means, unless you allow it. You can present false thoughts by making a Charisma (Deception) check contested by the mind reader's Wisdom (Insight) check. Additionally, no matter what you say, magic that would determine if you are telling the truth indicates you are being truthful if you so choose, and you can't be compelled to tell the truth by magic.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "Phantom": {
            "name": "Phantom",
            "description": "Many rogues walk a fine line between life and death, risking their own lives and taking the lives of others. While adventuring on that line, some rogues discover a mystical connection to death itself. These rogues take knowledge from the dead and become immersed in negative energy, eventually becoming like ghosts. Thieves' guilds value them as highly effective information gatherers and spies. A Phantom can become a wizard's confidant and right hand. In temples of gods of death, the Phantom might work as an agent to track down those who try to cheat death and to recover knowledge that might otherwise be lost to the grave.",
            "features": {
                "3": [
                    {
                        "name": "WHISPERS OF THE DEAD",
                        "description": "Echoes of those who have died cling to you. Whenever you finish a short or long rest, you can gain one skill or tool proficiency of your choice, as a ghostly presence shares its knowledge with you. You lose this proficiency when you use this feature to choose a different proficiency that you lack.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "WAILS FROM THE GRAVE",
                        "description": "As you nudge someone closer to the grave, you can channel the power of death to harm someone else as well. Immediately after you deal your Sneak Attack damage to a creature on your turn, you can target a second creature that you can see within 30 feet of the first creature. Roll half the number of Sneak Attack dice for your level (round up), and the second creature takes necrotic damage equal to the roll’s total, as wails of the dead sound around them for a moment. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "TOKENS OF THE DEPARTED",
                        "description": "When a life ends in your presence, you're able to snatch a token from the departing soul, a sliver of its life essence that takes physical form: as a reaction when a creature you can see dies within 30 feet of you, you can open your free hand and cause a Tiny trinket to appear there, a soul trinket. The DM determines the trinket's form or has you roll on the Trinkets table in the Player's Handbook to generate it. You can have a maximum number of soul trinkets equal to your proficiency bonus, and you can't create one while at your maximum. You can use soul trinkets in the following ways: While a soul trinket is on your person, you have advantage on death saving throws and Constitution saving throws, for your vitality is enhanced by the life essence within the object. When you deal Sneak Att...",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "GHOST WALK",
                        "description": "You can phase partially into the realm of the dead, becoming like a ghost. As a bonus action, you assume a spectral form. While in this form, you have a flying speed of 10 feet, you can hover, and attack rolls have disadvantage against you. You can also move through creatures and objects as if they were difficult terrain, but you take 1d10 force damage if you end your turn inside a creature or an object. You stay in this form for 10 minutes or until you end it as a bonus action. To use this feature again, you must finish a long rest or destroy one of your soul trinkets as part of the bonus action you use to activate Ghost Walk.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "DEATH KNELL",
                        "description": "Your association with death has become so close that you gain the following benefits: When you use your Wails from the Grave, you can now deal the necrotic damage to both the first and the second creature. At the end of a long rest, a soul trinket appears in your hand if you don't have any soul trinkets, as the spirits of the dead are drawn to you.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "Scout": {
            "name": "Scout",
            "description": "You are skilled in stealth and surviving far from the streets of a city, allowing you to scout ahead of your companions during expeditions. Rogues who embrace this archetype are at home in the wilderness and among barbarians and rangers, and many Scouts serve as the eyes and ears of war bands. Ambusher, spy, bounty hunter – these are just a few of the roles that Scouts assume as they range the world.",
            "features": {
                "3": [
                    {
                        "name": "SKIRMISHER",
                        "description": "You are difficult to pin down during a fight. You can move up to half your speed as a reaction when an enemy ends its turn within 5 feet of you. This movement doesn’t provoke opportunity attacks.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "SURVIVALIST",
                        "description": "You gain proficiency in the Nature and Survival skills if you don't already have it. Your proficiency bonus is doubled for any ability check you make that uses either of those proficiencies. (Expertise)",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "SUPERIOR MOBILITY",
                        "description": "Your walking speed increases by 10 feet. If you have a climbing or swimming speed, this increase applies to that speed as well.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "AMBUSH MASTER",
                        "description": "You excel at leading ambushes and acting first in a fight. You have advantage on initiative rolls. In addition, the first creature you hit during the first round of a combat becomes easier for you and others to strike; attack rolls against that target have advantage until the start of your next turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "SUDDEN STRIKE",
                        "description": "You can strike with deadly speed. If you take the Attack action on your turn, you can make one additional attack as a bonus action. This attack can benefit from your Sneak Attack even if you have already used it this turn, but you can't use your Sneak Attack against the same target more than once in a turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        },
        "SWASHBUCKLER": {
            "name": "SWASHBUCKLER",
            "description": "As a Swashbuckler, you focus on the art of the blade, bringing speed, elegance, and charm to your combat style—topped off with an exquisite flourish of panache. You excel in single combat, and your methods make a duel look like a flamboyant performance. 3RD LEVEL: FANCY FOOTWORK You’ve learned how to land a strike and then slip away without reprisal. If you make a melee attack against a creature during your turn, that creature can’t make Opportunity Attacks against you for the rest of that turn. 3RD LEVEL: RAKISH AUDACITY When you roll Initiative, you can give yourself a bonus to the roll equal to your Charisma modifier. You also gain an additional way to use your Sneak Attack; you don’t need Advantage on the attack roll to use your Sneak Attack against a creature if you are within 5 feet ...",
            "features": {
                "3": [
                    {
                        "name": "FANCY FOOTWORK",
                        "description": "You’ve learned how to land a strike and then slip away without reprisal. If you make a melee attack against a creature during your turn, that creature can’t make Opportunity Attacks against you for the rest of that turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    },
                    {
                        "name": "RAKISH AUDACITY",
                        "description": "When you roll Initiative, you can give yourself a bonus to the roll equal to your Charisma modifier. You also gain an additional way to use your Sneak Attack; you don’t need Advantage on the attack roll to use your Sneak Attack against a creature if you are within 5 feet of it, no other creatures are within 5 feet of you, and you don’t have Disadvantage on the attack roll. All the other rules for Sneak Attack still apply to you.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "9": [
                    {
                        "name": "PANACHE",
                        "description": "You have practiced new ways to use your Sneak Attack. The following effects are now among your Cunning Strike options. Goad (Cost: 1d6). The target must succeed on a Wisdom saving throw, or until the end of its next turn, the target has Disadvantage on attack rolls against targets other than you and can’t make Opportunity Attacks against targets other than you. Awe (Cost: 3d6). Each creature of your choice within 30 feet of you must succeed on a Wisdom saving throw or have the Charmed condition until the end of your next turn.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "13": [
                    {
                        "name": "DASHING STRIKES",
                        "description": "You have practiced new ways to use your Sneak Attack. The following effects are now among your Cunning Strike options. Parrying Stance (Cost: 2d6). Roll a d6. Until the start of your next turn, you gain a bonus to your AC equal to the number rolled. Invigorate (Cost: 2d6). Choose a creature you can see within 30 feet of yourself. Until the end of that creature’s next turn, whenever it makes an attack roll or a saving throw, it can roll a d6 and add the number rolled to the attack roll or saving throw.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ],
                "17": [
                    {
                        "name": "MASTER DUELIST",
                        "description": "Immediately after you use your Sneak Attack, you can make another attack against the same target, provided you are within 5 feet of it and no other creatures are within 5 feet of you.",
                        "mechanics": {
                            "type": "passive"
                        }
                    }
                ]
            }
        }
    }
}